/****************************************************************************
*|------------------------------------------------------------------------
*|-------------------------------LCD驱动库------------------------------
****************************************************************************/

#ifndef BASEPROJECT_LCD_H
#define BASEPROJECT_LCD_H


#include "Framework.h"
#include "lcd_page.h"
#include "tftlcd.h"

/****************************************************************************************************************/

//节点
typedef struct p_node
{
    lcd_page*               page;  // 5个按键下标1--5(0为无效判定)
    struct p_node*          next;
}page_node;

//头结点
typedef struct p_head
{
    int                     length;
    struct p_node*          next;
}phead;

typedef struct lcd_class{
    phead*                  page_head;
    lcd_page*               now_page;

    /*=====================================================================================*/
    /********************************************************************
    *功能：LCD 初始化函数													*
    *参数：1.device：类的实例											    *
    *说明：函数中需要放入LCD外设初始化，触摸初始化								*
    *********************************************************************/
    void        (*Init)             (struct lcd_class* device);

    /********************************************************************
	*功能：添加一个Page					    							*
	*参数：1.device：类的实例											    *
	*	   2.page: 需要添加的page		        							*
	*说明：无															    *
	*********************************************************************/
    void        (*Add_Page)         (struct lcd_class* device, lcd_page* page);

    /********************************************************************
    *功能：LCD 运行函数													*
    *参数：1.device：类的实例											    *
    *说明：LCD运行函数里面放着一个LCD刷新屏幕，扫描按键，实施按键函数等操作			*
    *********************************************************************/
    void        (*Run)              (struct lcd_class* device);

    /********************************************************************
    *功能：LCD显示初始化													*
    *参数：1.device：类的实例											    *
    *说明：无															    *
    *********************************************************************/
    void        (*Show_Init)        (struct lcd_class* device);

    /********************************************************************
    *功能：刷新按键显示函数													*
    *参数：1.device：类的实例											    *
    *说明：无															    *
    *********************************************************************/
    void        (*Refresh_Button)   (struct lcd_class* device);
}lcd;


/*==============================================================================================================================*/

void LCD_Prepare(lcd* device);
void LCD_Switch_Page(struct lcd_class* device);

#endif //BASEPROJECT_LCD_H


